#############################################
#Important note
#Run install
#############################################
#المكتبات المستخدمه
import pyqrcode,png
from pyqrcode import QRCode 
#############################################
#الحقوق
print('''

 ██████╗ ██████╗      ██████╗ ██████╗ ██████╗ ███████╗
██╔═══██╗██╔══██╗    ██╔════╝██╔═══██╗██╔══██╗██╔════╝
██║   ██║██████╔╝    ██║     ██║   ██║██║  ██║█████╗  
██║▄▄ ██║██╔══██╗    ██║     ██║   ██║██║  ██║██╔══╝  
╚██████╔╝██║  ██║    ╚██████╗╚██████╔╝██████╔╝███████╗
 ╚══▀▀═╝ ╚═╝  ╚═╝     ╚═════╝ ╚═════╝ ╚═════╝ ╚══════╝

=========================
=      My rights        =
=    twitter:@S75XD     =
=   telegram:@S75XD     =
========================= 
''')
#############################################
#الكود المستخدم
print('''
=============================
1>png photo
2>svg web
=============================
''')
Tb = input('pngQR1 or webQR2 :')

if Tb == '1':
    s = input('enter you url :')
    url = pyqrcode.create(s) 
    url.png('myQR.png', scale = 6)
#edit name file ^^^^^

elif Tb == '2':
    s = input('enter you url :')
    url = pyqrcode.create(s)    
    url.svg("myQR.svg", scale = 8) 
#edit name file ^^^^^

#############################################
